R1#sh in
========================== serial 1/2 ========================
serial 1/2 is UP  , line protocol is UP  
Hardware is PQ2 SCC HDLC CONTROLLER serial
Interface address is: 172.16.21.1/24
  MTU 1500 bytes, BW 2000 Kbit
  Encapsulation protocol is HDLC, loopback not set
  Keepalive interval is 10 sec , set
  Carrier delay is 2 sec
  RXload is 1 ,Txload is 1
  Queueing strategy: WFQ
  5 minutes input rate 17 bits/sec, 0 packets/sec
  5 minutes output rate 17 bits/sec, 0 packets/sec
    343 packets input, 7546 bytes, 0 no buffer
    Received 343 broadcasts, 0 runts, 0 giants
    0 input errors, 0 CRC, 0 frame, 0 overrun, 0 abort
    343 packets output, 7546 bytes, 0 underruns
    0 output errors, 0 collisions, 2 interface resets
    1 carrier transitions
    V35 DCE cable
    DCD=up  DSR=up  DTR=up  RTS=up  CTS=up
========================== serial 1/3 ========================
serial 1/3 is DOWN  , line protocol is DOWN  
Hardware is PQ2 SCC HDLC CONTROLLER serial
Interface address is: no ip address
  MTU 1500 bytes, BW 2000 Kbit
  Encapsulation protocol is HDLC, loopback not set
  Keepalive interval is 10 sec , set
  Carrier delay is 2 sec
  RXload is 1 ,Txload is 1
  Queueing strategy: WFQ
  5 minutes input rate 0 bits/sec, 0 packets/sec
  5 minutes output rate 0 bits/sec, 0 packets/sec
    0 packets input, 0 bytes, 0 no buffer
    Received 0 broadcasts, 0 runts, 0 giants
    0 input errors, 0 CRC, 0 frame, 0 overrun, 0 abort
    0 packets output, 0 bytes, 0 underruns
    0 output errors, 0 collisions, 1 interface resets
    0 carrier transitions
    No cable
    DCD=down  DSR=down  DTR=down  RTS=down  CTS=down
========================== FastEthernet 1/0 ========================
FastEthernet 1/0 is UP  , line protocol is UP  
Hardware is PQ2 FCC FAST ETHERNET CONTROLLER FastEthernet, address is 00d0.f888.539a (bia 00d0.f888.539a)
Interface address is: 172.16.1.1/24
ARP type: ARPA,ARP Timeout: 3600 seconds
  MTU 1500 bytes, BW 100000 Kbit
  Encapsulation protocol is Ethernet-II, loopback not set
  Keepalive interval is 10 sec , set
  Carrier delay is 2 sec
  RXload is 1 ,Txload is 1
  Queueing strategy: FIFO
    Output queue 0/40, 0 drops;
    Input queue 0/75, 0 drops
  5 minutes input rate 0 bits/sec, 0 packets/sec
  5 minutes output rate 0 bits/sec, 0 packets/sec
    0 packets input, 0 bytes, 0 no buffer
    Received 0 broadcasts, 0 runts, 0 giants
    0 input errors, 0 CRC, 0 frame, 0 overrun, 0 abort
    1 packets output, 42 bytes, 0 underruns
    0 output errors, 0 collisions, 6 interface resets
  Link Mode: 100M/Full-Duplex
========================== FastEthernet 1/1 ========================
FastEthernet 1/1 is DOWN  , line protocol is DOWN  
Hardware is PQ2 FCC FAST ETHERNET CONTROLLER FastEthernet, address is 00d0.f888.5399 (bia 00d0.f888.5399)
Interface address is: no ip address
ARP type: ARPA,ARP Timeout: 3600 seconds
  MTU 1500 bytes, BW 100000 Kbit
  Encapsulation protocol is Ethernet-II, loopback not set
  Keepalive interval is 10 sec , set
  Carrier delay is 2 sec
  RXload is 1 ,Txload is 1
  Queueing strategy: FIFO
    Output queue 0/40, 0 drops;
    Input queue 0/75, 0 drops
  5 minutes input rate 0 bits/sec, 0 packets/sec
  5 minutes output rate 0 bits/sec, 0 packets/sec
    0 packets input, 0 bytes, 0 no buffer
    Received 0 broadcasts, 0 runts, 0 giants
    0 input errors, 0 CRC, 0 frame, 0 overrun, 0 abort
    0 packets output, 0 bytes, 0 underruns
    0 output errors, 0 collisions, 5 interface resets
========================== Null 0 ========================
Null 0 is UP  , line protocol is UP  
Hardware is  Null
Interface address is: no ip address
  MTU 1500 bytes, BW 8000000 Kbit
  Encapsulation protocol is NULL, loopback not set
  Keepalive interval is 0 sec , no set
  Carrier delay is 2 sec
  RXload is 1 ,Txload is 1
  Queueing strategy: FIFO
    Output queue 0/40, 0 drops;
    Input queue 0/75, 0 drops
  5 minutes input rate 0 bits/sec, 0 packets/sec
  5 minutes output rate 0 bits/sec, 0 packets/sec
    0 packets input, 0 bytes, 0 no buffer
    Received 0 broadcasts, 0 runts, 0 giants
    0 input errors, 0 CRC, 0 frame, 0 overrun, 0 abort
    0 packets output, 0 bytes, 0 underruns
    0 output errors, 0 collisions, 0 interface resets




R1#sh run

Building configuration...
Current configuration : 456 bytes

!
version 8.32(building 53)
hostname R1
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
interface serial 1/2
 ip address 172.16.21.1 255.255.255.0
 clock rate 64000
!         
interface serial 1/3
 clock rate 64000
!         
interface FastEthernet 1/0
 ip address 172.16.1.1 255.255.255.0
 duplex auto
 speed auto
!         
interface FastEthernet 1/1
 duplex auto
 speed auto
!         
interface Null 0
!         
!         
!         
!         
line con 0
line aux 0
line vty 0 4
 login    
!         
!         
end       




Switch#sh run

Building configuration...
Current configuration : 1161 bytes

!
version RGOS 10.2(5p1), Release(122585)(Wed Aug 24 11:37:41 CST 2011 -ngcf67)
!
!
!
vlan 1
!
!
no service password-encryption
!
!
ip default-gateway 172.16.1.1
!
!
!
!
!
!
hostname Switch
interface FastEthernet 0/1
!         
interface FastEthernet 0/2
!
interface FastEthernet 0/3
!
interface FastEthernet 0/4
!
interface FastEthernet 0/5
!
interface FastEthernet 0/6
!
interface FastEthernet 0/7
!
interface FastEthernet 0/8
!
interface FastEthernet 0/9
!
interface FastEthernet 0/10
!
interface FastEthernet 0/11
!
interface FastEthernet 0/12
!
interface FastEthernet 0/13
!         
interface FastEthernet 0/14
!
interface FastEthernet 0/15
!
interface FastEthernet 0/16
!
interface FastEthernet 0/17
!
interface FastEthernet 0/18
!
interface FastEthernet 0/19
!
interface FastEthernet 0/20
!
interface FastEthernet 0/21
!
interface FastEthernet 0/22
!
interface FastEthernet 0/23
!
interface FastEthernet 0/24
!
interface GigabitEthernet 0/25
!         
interface GigabitEthernet 0/26
!
interface VLAN 1
 ip address 172.16.1.100 255.255.255.0
 no shutdown
!
!
line con 0
line vty 0 4
 login
!
!
end




Switch#ping 172.16.21.1 
Sending 5, 100-byte ICMP Echoes to 172.16.21.1, timeout is 2 seconds:
  < press Ctrl+C to break >
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/2/10 ms




Switch#ping 172.16.2.100
Sending 5, 100-byte ICMP Echoes to 172.16.2.100, timeout is 2 seconds:
  < press Ctrl+C to break >
.....
Success rate is 0 percent (0/5)





Switch#sh ip in
VLAN 1
  IP interface state is: UP
  IP interface type is: BROADCAST
  IP interface MTU is: 1500
  IP address is: 
    172.16.1.100/24 (primary)
  IP address negotiate is: OFF
  Forward direct-broadcast is: OFF
  ICMP mask reply is: ON
  Send ICMP redirect is: ON
  Send ICMP unreachabled is: ON
  DHCP relay is: OFF
  Fast switch is: ON
  Help address is: 
  Proxy ARP is: OFF



R1#ping 172.16.21.2
Sending 5, 100-byte ICMP Echoes to 172.16.21.2, timeout is 2 seconds:
  < press Ctrl+C to break >
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 37/37/37 ms
R1#





Switch#ping 172.16.2.100
Sending 5, 100-byte ICMP Echoes to 172.16.2.100, timeout is 2 seconds:
  < press Ctrl+C to break >
.....
Success rate is 0 percent (0/5)

R1#con te                                       
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip route 172.16.2.0 255.255.255.0 172.16.21.2
R1(config)#end

Switch#ping 172.16.2.100
Sending 5, 100-byte ICMP Echoes to 172.16.2.100, timeout is 2 seconds:
  < press Ctrl+C to break >
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 30/34/40 ms


R1#con te
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#no ip route 172.16.2.0 255.255.255.0 172.16.21.2
R1(config)#end
R1#con te
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#ip route 0.0.0.0 0.0.0.0 172.16.21.2
R1(config)#end

Switch#ping 172.16.2.100
Sending 5, 100-byte ICMP Echoes to 172.16.2.100, timeout is 2 seconds:
  < press Ctrl+C to break >
!!!!!

